feedly/app/views/statuses/_status.html.erb

      <b>Comments</b>
      <% status.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`status_id` = 5