feedly/app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.statuses.any? %>
---
SELECT  1 AS one FROM `statuses` WHERE `statuses`.`user_id` = 1 LIMIT 1