feedly/app/controllers/comments_controller.rb

SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 5  ORDER BY `statuses`.`created_at` DESC LIMIT 1
INSERT INTO `comments` (`body`, `status_id`, `user_id`, `created_at`, `updated_at`) VALUES ('done finally', 5, 1, '2015-12-10 19:47:15', '2015-12-10 19:47:15')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def create
    @status = Status.find(params[:status_id])
    @comment = Comment.create(comment_params)
    @user=User.find_by(id: @status.user_id)