feedly/app/controllers/static_pages_controller.rb

SELECT  `statuses`.* FROM `statuses` WHERE (user_id = 1)  ORDER BY `statuses`.`created_at` DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `statuses` WHERE (user_id = 1)
---
  def home
  	if logged_in?
      @status  = current_user.statuses.build
      #status_id_list=current_user.statuses.map {|status| status.id}
      #@comment = Comment.includes(:status).where(status_id: status_id_list).index_by(&:id)
      @feed_items = current_user.feed.paginate(page: params[:page], :per_page => 4)