feedly/app/controllers/statuses_controller.rb

  def create
  	@status = current_user.statuses.build(status_params)
    @status.upvotes=0
    @status.downvotes=0
    if @status.save
---
INSERT INTO `statuses` (`content`, `picture`, `user_id`, `votes`, `created_at`, `updated_at`) VALUES ('Great', 'atka.png', 1, 0, '2015-12-10 16:59:59', '2015-12-10 16:59:59')

  def destroy
  	@status.destroy
---
DELETE FROM `statuses` WHERE `statuses`.`id` = 1

  def upvote
    @status = Status.find(params[:id])
    @status.upvotes=@status.upvotes+1
    @status.save
---
SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1  ORDER BY `statuses`.`created_at` DESC LIMIT 1
UPDATE `statuses` SET `upvotes` = 1, `updated_at` = '2015-12-11 06:27:24' WHERE `statuses`.`id` = 1

  def downvote
    @status = Status.find(params[:id])
    @status.downvotes=@status.downvotes+1
    @status.save
---
SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1  ORDER BY `statuses`.`created_at` DESC LIMIT 1
UPDATE `statuses` SET `downvotes` = 1, `updated_at` = '2015-12-11 06:27:17' WHERE `statuses`.`id` = 1