feedly/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`user_id` = 1  ORDER BY `statuses`.`created_at` DESC LIMIT 4 OFFSET 0
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1000
SELECT COUNT(*) FROM `statuses` WHERE `statuses`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @statuses = @user.statuses.paginate(page: params[:page], :per_page => 4)